MCUdude/MiniCore/avr/boards.txt
# Variants
88.menu.variant.modelP=88P / 88PA
88.menu.variant.modelP.bootloader.cksel_bits=0111
88.menu.variant.modelP.build.variant=standard
88.menu.variant.modelP.build.mcu=atmega88p

88.menu.variant.modelNonP=88 / 88A
88.menu.variant.modelNonP.bootloader.cksel_bits=0111
88.menu.variant.modelNonP.build.variant=standard
88.menu.variant.modelNonP.build.mcu=atmega88

88.menu.variant.modelPB=88PB
88.menu.variant.modelPB.bootloader.cksel_bits=1111
88.menu.variant.modelPB.build.variant=pb-variant
88.menu.variant.modelPB.build.mcu=atmega88pb

# Brown out detection
88.menu.BOD.2v7=2.7v
88.menu.BOD.2v7.bootloader.high_fuses=0xd5
88.menu.BOD.4v3=4.3v
88.menu.BOD.4v3.bootloader.high_fuses=0xd4
88.menu.BOD.1v8=1.8v
88.menu.BOD.1v8.bootloader.high_fuses=0xd6
88.menu.BOD.disabled=Disabled
88.menu.BOD.disabled.bootloader.high_fuses=0xd7

# Compiler link time optimization
88.menu.LTO.Os=Disabled (default)
88.menu.LTO.Os.compiler.c.extra_flags=
88.menu.LTO.Os.compiler.c.elf.extra_flags=
88.menu.LTO.Os.compiler.cpp.extra_flags=
88.menu.LTO.Os.ltoarcmd=avr-ar

88.menu.LTO.Os_flto=Enabled
88.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
88.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
88.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
88.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies
88.menu.clock.16MHz_external=16 MHz external
88.menu.clock.16MHz_external.upload.port=UART0
88.menu.clock.16MHz_external.upload.speed=115200
88.menu.clock.16MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
88.menu.clock.16MHz_external.build.f_cpu=16000000L

88.menu.clock.20MHz_external=20 MHz external
88.menu.clock.20MHz_external.upload.port=UART0
88.menu.clock.20MHz_external.upload.speed=115200
88.menu.clock.20MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
88.menu.clock.20MHz_external.build.f_cpu=20000000L

88.menu.clock.18_432MHz_external=18.432 MHz external
88.menu.clock.18_432MHz_external.upload.port=UART0
88.menu.clock.18_432MHz_external.upload.speed=115200
88.menu.clock.18_432MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
88.menu.clock.18_432MHz_external.build.f_cpu=18432000L

88.menu.clock.12MHz_external=12 MHz external
88.menu.clock.12MHz_external.upload.port=UART0
88.menu.clock.12MHz_external.upload.speed=57600
88.menu.clock.12MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
88.menu.clock.12MHz_external.build.f_cpu=12000000L

88.menu.clock.8MHz_external=8 MHz external
88.menu.clock.8MHz_external.upload.port=UART0
88.menu.clock.8MHz_external.upload.speed=38400
88.menu.clock.8MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
88.menu.clock.8MHz_external.build.f_cpu=8000000L

88.menu.clock.8MHz_internal=8 MHz internal
88.menu.clock.8MHz_internal.upload.port=UART0
88.menu.clock.8MHz_internal.upload.speed=38400
88.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
88.menu.clock.8MHz_internal.build.f_cpu=8000000L

88.menu.clock.1MHz_internal=1 MHz internal
88.menu.clock.1MHz_internal.upload.port=UART0
88.menu.clock.1MHz_internal.upload.speed=9600
88.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
88.menu.clock.1MHz_internal.build.f_cpu=1000000L


############################
#### ATmega48/A/P/PA/PB ####
############################

# General
48.name=ATmega48
48.upload.tool=avrdude
48.upload.using=avrdude
48.upload.maximum_size=4096
48.upload.maximum_data_size=512
48.bootloader.tool=avrdude
48.bootloader.unlock_bits=0x3f
48.bootloader.lock_bits=0x3f
48.bootloader.extended_fuses=0xff
48.build.core=MCUdude_corefiles
48.build.board=AVR_ATmega48

# Bootloader select
48.menu.bootloader.false=No
48.menu.bootloader.false.upload.maximum_size=4096
48.menu.bootloader.false.bootloader.file=empty/empty.hex

# Variants
48.menu.variant.modelP=48P / 48PA
48.menu.variant.modelP.bootloader.cksel_bits=0111
48.menu.variant.modelP.build.variant=standard
48.menu.variant.modelP.build.mcu=atmega48p

48.menu.variant.modelNonP=48 / 48A
48.menu.variant.modelNonP.bootloader.cksel_bits=0111
48.menu.variant.modelNonP.build.variant=standard
48.menu.variant.modelNonP.build.mcu=atmega48

48.menu.variant.modelPB=48PB
48.menu.variant.modelPB.bootloader.cksel_bits=1111
48.menu.variant.modelPB.build.variant=pb-variant
48.menu.variant.modelPB.build.mcu=atmega48pb

# Brown out detection
48.menu.BOD.2v7=2.7v
48.menu.BOD.2v7.bootloader.high_fuses=0xd5
48.menu.BOD.4v3=4.3v
48.menu.BOD.4v3.bootloader.high_fuses=0xd4
48.menu.BOD.1v8=1.8v
48.menu.BOD.1v8.bootloader.high_fuses=0xd6
48.menu.BOD.disabled=Disabled
48.menu.BOD.disabled.bootloader.high_fuses=0xd7

# Compiler link time optimization
48.menu.LTO.Os=Disabled (default)
48.menu.LTO.Os.compiler.c.extra_flags=
48.menu.LTO.Os.compiler.c.elf.extra_flags=
48.menu.LTO.Os.compiler.cpp.extra_flags=
48.menu.LTO.Os.ltoarcmd=avr-ar

48.menu.LTO.Os_flto=Enabled
48.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
48.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
48.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
48.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies
48.menu.clock.16MHz_external=16 MHz external
48.menu.clock.16MHz_external.upload.speed=115200
48.menu.clock.16MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
48.menu.clock.16MHz_external.build.f_cpu=16000000L

48.menu.clock.20MHz_external=20 MHz external
48.menu.clock.20MHz_external.upload.speed=115200
48.menu.clock.20MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
48.menu.clock.20MHz_external.build.f_cpu=20000000L

48.menu.clock.18_432MHz_external=18.432 MHz external
48.menu.clock.18_432MHz_external.upload.speed=115200
48.menu.clock.18_432MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
48.menu.clock.18_432MHz_external.build.f_cpu=18432000L

48.menu.clock.12MHz_external=12 MHz external
48.menu.clock.12MHz_external.upload.speed=57600
48.menu.clock.12MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
48.menu.clock.12MHz_external.build.f_cpu=12000000L

